public/blog/outlook-fix-godaddy-email-server-not-being-found/index.html
<!DOCTYPE html>
<html lang="en">
<head>  <meta charset="UTF-8">
  <title>Outlook Fix Godaddy Email Server Not Being Found</title>
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <link rel="stylesheet" href="/css/gtd.css">
  <link href="https://cdnjs.cloudflare.com/ajax/libs/prism/1.27.0/themes/prism-tomorrow.min.css" rel="stylesheet">
</head>
<body>
  
<main>
  <h1>Outlook Fix Godaddy Email Server Not Being Found</h1>

  <nav class="toc">
    <nav id="TableOfContents">
<ul>
<li><a href="#headline-1">The Issue</a>
</li>
<li><a href="#headline-2">Possible Cause</a>
</li>
<li><a href="#headline-3">Solution</a>
</li>
</ul>
</nav>
  </nav> 

  <article>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
The Issue
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>When adding a GoDaddy or Exchange account to outlook, sometimes you&#39;ll
get this error when outlook attempts to automatically add the
email: &#34;Something went wrong and outlook couldn&#39;t setup your account&#34;.</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
Possible Cause
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<p>
Exchange uses an auto discover service to download configuration
settings for setting up the email. Outlook grabs the domain from your
email and constructs a URL that looks a little something like this.</p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>https://autodiscover.example.com/autodiscover/autodiscover.xml</span></span></code></pre></div>
</div>
<p>
The server should respond back with email configuration data in that
XML file. At that point you&#39;ll get a GoDaddy login window (OATH2.0)
and can add your account. Sometimes it fucks up and Outlook isn&#39;t able
to retrieve the email server configurations from that address. It then
fallsback on the last known good autodiscover address and fails too.</p>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
Solution
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>
I don&#39;t know why this works, but if you add this registry key that
tells Outlook to not use a fall back autodiscover URL, the issue is
resolved. Maybe Outlook is defaulting to using the last known url
by default? Who knows! </p>
<div class="src src-text">
<div class="highlight"><pre tabindex="0" style="color:#f8f8f2;background-color:#272822;-moz-tab-size:4;-o-tab-size:4;tab-size:4;"><code class="language-text" data-lang="text"><span style="display:flex;"><span>Key: HKEY_CURRENT_USER:\SOFTWARE\Microsoft\Office\16.0\Outlook\AutoDiscover
</span></span><span style="display:flex;"><span>NAME: ExcludeLastKnownGoodUrl 
</span></span><span style="display:flex;"><span>VALUE: 1</span></span></code></pre></div>
</div>
</div>
</div>

  </article>
</main>

</body>
</html>
